---
kind: property
id: P:Autodesk.Revit.DB.SweptBlend.TopProfile
source: html/d45b3fae-e6c6-8145-bcea-9b33086a6e16.htm
---
# Autodesk.Revit.DB.SweptBlend.TopProfile Property

The curves which make up the top profile of the sketch.

## Syntax (C#)
```csharp
public CurveArrArray TopProfile { get; }
```

## Remarks
The indices of the curves in this array match the indices used in the vertex connection map.